# More Basics of Pandas

Last session we introduced Pandas quickly. Now we review the basics of using Pandas, with a more interactive workflow to solidify understanding and facility with this powerful Python toolkit.

## Reviewing Pandas Basics

In [5]:
from pandas import DataFrame
import pandas as pd

In [8]:
import pandas as pd
df = pd.read_csv('DEC_10_SF1_P1_with_ann.csv')

### Basics of indexing in Pandas

The first use of indexing is to use a slice, just like we have done with other Python objects. Below we slice the first 5 index values of the first dimension of the dataframe.

In [9]:
df[:5]

,Id,Id2,Geography,Population
0,1400000US21001970100,21001970100,"Census Tract 9701, Adair County, Kentucky",1727
1,1400000US21001970200,21001970200,"Census Tract 9702, Adair County, Kentucky",1722
2,1400000US21001970300,21001970300,"Census Tract 9703, Adair County, Kentucky",3016
3,1400000US21001970401,21001970401,"Census Tract 9704.01, Adair County, Kentucky",4070
4,1400000US21001970402,21001970402,"Census Tract 9704.02, Adair County, Kentucky",4261

The first indexing method is equivalent to usinf the iloc indexing method, which uses the integer based indexing, purely based on the location of the index.

In [10]:
df.iloc[:5]

,Id,Id2,Geography,Population
0,1400000US21001970100,21001970100,"Census Tract 9701, Adair County, Kentucky",1727
1,1400000US21001970200,21001970200,"Census Tract 9702, Adair County, Kentucky",1722
2,1400000US21001970300,21001970300,"Census Tract 9703, Adair County, Kentucky",3016
3,1400000US21001970401,21001970401,"Census Tract 9704.01, Adair County, Kentucky",4070
4,1400000US21001970402,21001970402,"Census Tract 9704.02, Adair County, Kentucky",4261

A second way to index is using loc, which uses the labels of the index. Note that this approach includes the second value in the index range, whereas iloc does not.

In [11]:
df.loc[:5]

,Id,Id2,Geography,Population
0,1400000US21001970100,21001970100,"Census Tract 9701, Adair County, Kentucky",1727
1,1400000US21001970200,21001970200,"Census Tract 9702, Adair County, Kentucky",1722
2,1400000US21001970300,21001970300,"Census Tract 9703, Adair County, Kentucky",3016
3,1400000US21001970401,21001970401,"Census Tract 9704.01, Adair County, Kentucky",4070
4,1400000US21001970402,21001970402,"Census Tract 9704.02, Adair County, Kentucky",4261
5,1400000US21001970500,21001970500,"Census Tract 9705, Adair County, Kentucky",2457

Note that indexing can work for both rows and colums

In [12]:
df.loc[:5, : 'Geography']

,Id,Id2,Geography
0,1400000US21001970100,21001970100,"Census Tract 9701, Adair County, Kentucky"
1,1400000US21001970200,21001970200,"Census Tract 9702, Adair County, Kentucky"
2,1400000US21001970300,21001970300,"Census Tract 9703, Adair County, Kentucky"
3,1400000US21001970401,21001970401,"Census Tract 9704.01, Adair County, Kentucky"
4,1400000US21001970402,21001970402,"Census Tract 9704.02, Adair County, Kentucky"
5,1400000US21001970500,21001970500,"Census Tract 9705, Adair County, Kentucky"

In [13]:
df.iloc[:5, :3]

,Id,Id2,Geography
0,1400000US21001970100,21001970100,"Census Tract 9701, Adair County, Kentucky"
1,1400000US21001970200,21001970200,"Census Tract 9702, Adair County, Kentucky"
2,1400000US21001970300,21001970300,"Census Tract 9703, Adair County, Kentucky"
3,1400000US21001970401,21001970401,"Census Tract 9704.01, Adair County, Kentucky"
4,1400000US21001970402,21001970402,"Census Tract 9704.02, Adair County, Kentucky"

We can select rows based on their value as well.  Notice that we nest df[df[condition]] to get this result.

In [14]:
df['Population'] < 200

0       False
1       False
2       False
3       False
4       False
        ...
1110    False
1111    False
1112    False
1113    False
1114    False
Name: Population, Length: 1115, dtype: bool

In [15]:
df[df['Population'] < 200]

,Id,Id2,Geography,Population
64,1400000US21015980100,21015980100,"Census Tract 9801, Boone County, Kentucky",0
124,1400000US21029980100,21029980100,"Census Tract 9801, Bullitt County, Kentucky",0
203,1400000US21047980100,21047980100,"Census Tract 9801, Christian County, Kentucky",0
255,1400000US21061980100,21061980100,"Census Tract 9801, Edmonson County, Kentucky",8
678,1400000US21111980100,21111980100,"Census Tract 9801, Jefferson County, Kentucky",0
803,1400000US21143980100,21143980100,"Census Tract 9801, Lyon County, Kentucky",0
878,1400000US21163980100,21163980100,"Census Tract 9801, Meade County, Kentucky",9
1053,1400000US21221980100,21221980100,"Census Tract 9801, Trigg County, Kentucky",18
1054,1400000US21221980200,21221980200,"Census Tract 9802, Trigg County, Kentucky",6

In [16]:
df['Id2']==21015980100

0       False
1       False
2       False
3       False
4       False
        ...
1110    False
1111    False
1112    False
1113    False
1114    False
Name: Id2, Length: 1115, dtype: bool

In [17]:
df[df['Id2']==21015980100]

,Id,Id2,Geography,Population
64,1400000US21015980100,21015980100,"Census Tract 9801, Boone County, Kentucky",0

Here we show how to set a value of a cell in the table, identifying a specific row by index label, and setting its population, in this case to a None value, which Pandas interprets as a NaN (missing value).

In [18]:
df.loc[688,'Population'] = None

We can filter for values that are Null

In [19]:
df[df['Population'].isnull()]

,Id,Id2,Geography,Population
688,1400000US21115960100,21115960100,"Census Tract 9601, Johnson County, Kentucky",NaN

Or more commonly, filter out the null values.

In [20]:
df[df['Population'].notnull()]

,Id,Id2,Geography,Population
0,1400000US21001970100,21001970100,"Census Tract 9701, Adair County, Kentucky",1727.0
1,1400000US21001970200,21001970200,"Census Tract 9702, Adair County, Kentucky",1722.0
2,1400000US21001970300,21001970300,"Census Tract 9703, Adair County, Kentucky",3016.0
3,1400000US21001970401,21001970401,"Census Tract 9704.01, Adair County, Kentucky",4070.0
4,1400000US21001970402,21001970402,"Census Tract 9704.02, Adair County, Kentucky",4261.0
...,...,...,...,...
1110,1400000US21239050106,21239050106,"Census Tract 501.06, Woodford County, Kentucky",3261.0
1111,1400000US21239050107,21239050107,"Census Tract 501.07, Woodford County, Kentucky",3757.0
1112,1400000US21239050200,21239050200,"Census Tract 502, Woodford County, Kentucky",3533.0
1113,1400000US21239050300,21239050300,"Census Tract 503, Woodford County, Kentucky",1899.0
1114,1400000US21239050400,21239050400,"Census Tract 504, Woodford County, Kentucky",2279.0

Here we find and print records that are in Fayette County, using the str attribute and 'contains' to search for the county name in geodisplay.

In [21]:
df[df['Geography'].str.contains('Fayette County')]

,Id,Id2,Geography,Population
262,1400000US21067000101,21067000101,"Census Tract 1.01, Fayette County, Kentucky",3072.0
263,1400000US21067000102,21067000102,"Census Tract 1.02, Fayette County, Kentucky",1567.0
264,1400000US21067000200,21067000200,"Census Tract 2, Fayette County, Kentucky",3563.0
265,1400000US21067000300,21067000300,"Census Tract 3, Fayette County, Kentucky",3157.0
266,1400000US21067000400,21067000400,"Census Tract 4, Fayette County, Kentucky",1261.0
...,...,...,...,...
339,1400000US21067004205,21067004205,"Census Tract 42.05, Fayette County, Kentucky",6628.0
340,1400000US21067004207,21067004207,"Census Tract 42.07, Fayette County, Kentucky",3855.0
341,1400000US21067004208,21067004208,"Census Tract 42.08, Fayette County, Kentucky",7097.0
342,1400000US21067004209,21067004209,"Census Tract 42.09, Fayette County, Kentucky",3916.0
343,1400000US21067004210,21067004210,"Census Tract 42.10, Fayette County, Kentucky",4207.0

We can find the unique values of a column (not very interesting in this particular case)

We saw last time how to use the str attribute to do string manipulation, such as to create a new column.  We need to explore some more advanced string processing, but let's use a smaller dataframe for that.

In [16]:
df['state'] = df['Geography'].str.split(',').str[2]
df[:5]

,Id,Id2,Geography,Population,state
0,1400000US21001970100,21001970100,"Census Tract 9701, Adair County, Kentucky",1727.0,Kentucky
1,1400000US21001970200,21001970200,"Census Tract 9702, Adair County, Kentucky",1722.0,Kentucky
2,1400000US21001970300,21001970300,"Census Tract 9703, Adair County, Kentucky",3016.0,Kentucky
3,1400000US21001970401,21001970401,"Census Tract 9704.01, Adair County, Kentucky",4070.0,Kentucky
4,1400000US21001970402,21001970402,"Census Tract 9704.02, Adair County, Kentucky",4261.0,Kentucky

In [17]:
df['county'] = df['Geography'].str.split(',').str[1]
df[:5]

,Id,Id2,Geography,Population,state,county
0,1400000US21001970100,21001970100,"Census Tract 9701, Adair County, Kentucky",1727.0,Kentucky,Adair County
1,1400000US21001970200,21001970200,"Census Tract 9702, Adair County, Kentucky",1722.0,Kentucky,Adair County
2,1400000US21001970300,21001970300,"Census Tract 9703, Adair County, Kentucky",3016.0,Kentucky,Adair County
3,1400000US21001970401,21001970401,"Census Tract 9704.01, Adair County, Kentucky",4070.0,Kentucky,Adair County
4,1400000US21001970402,21001970402,"Census Tract 9704.02, Adair County, Kentucky",4261.0,Kentucky,Adair County

In [18]:
df['county'].unique()

array([' Adair County', ' Allen County', ' Anderson County',
       ' Ballard County', ' Barren County', ' Bath County',
       ' Bell County', ' Boone County', ' Bourbon County', ' Boyd County',
       ' Boyle County', ' Bracken County', ' Breathitt County',
       ' Breckinridge County', ' Bullitt County', ' Butler County',
       ' Caldwell County', ' Calloway County', ' Campbell County',
       ' Carlisle County', ' Carroll County', ' Carter County',
       ' Casey County', ' Christian County', ' Clark County',
       ' Clay County', ' Clinton County', ' Crittenden County',
       ' Cumberland County', ' Daviess County', ' Edmonson County',
       ' Elliott County', ' Estill County', ' Fayette County',
       ' Fleming County', ' Floyd County', ' Franklin County',
       ' Fulton County', ' Gallatin County', ' Garrard County',
       ' Grant County', ' Graves County', ' Grayson County',
       ' Green County', ' Greenup County', ' Hancock County',
       ' Hardin County', ' Harlan County', ' Harrison County',
       ' Hart County', ' Henderson County', ' Henry County',
       ' Hickman County', ' Hopkins County', ' Jackson County',
       ' Jefferson County', ' Jessamine County', ' Johnson County',
       ' Kenton County', ' Knott County', ' Knox County', ' Larue County',
       ' Laurel County', ' Lawrence County', ' Lee County',
       ' Leslie County', ' Letcher County', ' Lewis County',
       ' Lincoln County', ' Livingston County', ' Logan County',
       ' Lyon County', ' McCracken County', ' McCreary County',
       ' McLean County', ' Madison County', ' Magoffin County',
       ' Marion County', ' Marshall County', ' Martin County',
       ' Mason County', ' Meade County', ' Menifee County',
       ' Mercer County', ' Metcalfe County', ' Monroe County',
       ' Montgomery County', ' Morgan County', ' Muhlenberg County',
       ' Nelson County', ' Nicholas County', ' Ohio County',
       ' Oldham County', ' Owen County', ' Owsley County',
       ' Pendleton County', ' Perry County', ' Pike County',
       ' Powell County', ' Pulaski County', ' Robertson County',
       ' Rockcastle County', ' Rowan County', ' Russell County',
       ' Scott County', ' Shelby County', ' Simpson County',
       ' Spencer County', ' Taylor County', ' Todd County',
       ' Trigg County', ' Trimble County', ' Union County',
       ' Warren County', ' Washington County', ' Wayne County',
       ' Webster County', ' Whitley County', ' Wolfe County',
       ' Woodford County'], dtype=object)

And count how many times each unique value is in the data

In [19]:
df['county'].value_counts()

 Jefferson County     191
 Fayette County        82
 Kenton County         41
 Campbell County       25
 Warren County         24
                     ...
 Menifee County         2
 Cumberland County      2
 Wolfe County           2
 Hickman County         1
 Robertson County       1
Name: county, Length: 120, dtype: int64

### More complex use of Indexing and String Manipulation -- Cleaning the Bedroom Field in the Craigslist data

In [22]:
import pandas as pd
import numpy as np
cl = pd.read_csv('items.csv')
cl.head()

,neighborhood,title,price,bedrooms,pid,longitude,date,link,latitude,sqft,sourcepage
0,(SOMA / south beach),"1bed + Den, 1bath at Mission Bay",$2895,/ 1br - 950ft² -,4046628359,-122.399663,Sep 4 2013,/sfc/apa/4046628359.html,37.774623,/ 1br - 950ft² -,http://sfbay.craigslist.org/sfc/apa/
1,(SOMA / south beach),Love where you live!,$3354,/ 1br - 710ft² -,4046761563,NaN,Sep 4 2013,/sfc/apa/4046761563.html,NaN,/ 1br - 710ft² -,http://sfbay.craigslist.org/sfc/apa/
2,(inner sunset / UCSF),We Welcome Your Furry Friends! Call Today!,$2865,/ 1br - 644ft² -,4046661504,-122.470727,Sep 4 2013,/sfc/apa/4046661504.html,37.765739,/ 1br - 644ft² -,http://sfbay.craigslist.org/sfc/apa/
3,(financial district),Golden Gateway Commons | 2BR + office townhous...,$5500,/ 2br - 1450ft² -,4036170429,NaN,Sep 4 2013,/sfc/apa/4036170429.html,NaN,/ 2br - 1450ft² -,http://sfbay.craigslist.org/sfc/apa/
4,(lower nob hill),Experience Luxury Living in San Fransisco!,$3892,/ 2br -,4046732678,NaN,Sep 4 2013,/sfc/apa/4046732678.html,NaN,/ 2br -,http://sfbay.craigslist.org/sfc/apa/

This is a worked part of your assignment for this week.  Here is a code snippet that uses some of what we just learned above, and extends it to clean the bedroom field in this data.  Adapting it to clean sqft remains for you to do in the assignment...

Below are two different ways to do this.  The first involves looping over the index of the dataframe, and finding the beginning and end of the substring we are looking for, to isolate the bedrooms value.

In [23]:
for label in cl['bedrooms'].index:
    if isinstance(cl['bedrooms'][label], str) and not pd.isnull(cl['bedrooms'][label]):
        end = cl['bedrooms'][label].find('br')
        if end == -1:
            cl.loc[label,'bedrooms'] = np.nan
        else:
            start = cl['bedrooms'][label].find('/ ') + 2
            cl.loc[label,'bedrooms'] = int(cl['bedrooms'][label][start: end])
cl['bedrooms'][:9]

0      1
1      1
2      1
3      2
4      2
5      1
6    NaN
7      1
8      2
Name: bedrooms, dtype: object

Here is a second way to do this that is much more elegant, and in some ways much simpler since it does not require looping over the index values.  It uses the apply() method to apply an element-wise function.  This is covered briefly on page 133 of Pandas for Data Analysis, and more exensively in online documentation.

In [1]:
# first we create a method that works on a single instance
def clean_sf(value):
    ''' value - string from Craigslist entry that includes number of bedrooms
        returns - integer number of bedrooms
    '''
    if isinstance(value, str):
        end = value.find('ft')
        if end == -1:
            return 0
        else:
            start = value.find('-') + 2
            if start > end:
                start = value.find('/') + 2
                return int(value[start:end])
            else:
                return int(value[start:end])

In [2]:
# for example, we can apply it to a single string
clean_sf(' / 336ft² - ')

336

In [3]:
# and another
clean_sf('/ 2br - 1450ft² -')

1450

In [14]:
# really what we want to do is to apply it to all rows in a dataframe
# we can do this with a loop, similar to what we have above
cl = pd.read_csv('items.csv')

for i, row in cl.iterrows(): 
    cl.loc[i,'sq ft'] = clean_sf(row['bedrooms'])
cl[:9]

,neighborhood,title,price,bedrooms,pid,longitude,date,link,latitude,sqft,sourcepage,sq ft
0,(SOMA / south beach),"1bed + Den, 1bath at Mission Bay",$2895,/ 1br - 950ft² -,4046628359,-122.399663,Sep 4 2013,/sfc/apa/4046628359.html,37.774623,/ 1br - 950ft² -,http://sfbay.craigslist.org/sfc/apa/,950.0
1,(SOMA / south beach),Love where you live!,$3354,/ 1br - 710ft² -,4046761563,NaN,Sep 4 2013,/sfc/apa/4046761563.html,NaN,/ 1br - 710ft² -,http://sfbay.craigslist.org/sfc/apa/,710.0
2,(inner sunset / UCSF),We Welcome Your Furry Friends! Call Today!,$2865,/ 1br - 644ft² -,4046661504,-122.470727,Sep 4 2013,/sfc/apa/4046661504.html,37.765739,/ 1br - 644ft² -,http://sfbay.craigslist.org/sfc/apa/,644.0
3,(financial district),Golden Gateway Commons | 2BR + office townhous...,$5500,/ 2br - 1450ft² -,4036170429,NaN,Sep 4 2013,/sfc/apa/4036170429.html,NaN,/ 2br - 1450ft² -,http://sfbay.craigslist.org/sfc/apa/,1450.0
4,(lower nob hill),Experience Luxury Living in San Fransisco!,$3892,/ 2br -,4046732678,NaN,Sep 4 2013,/sfc/apa/4046732678.html,NaN,/ 2br -,http://sfbay.craigslist.org/sfc/apa/,0.0
5,(sunset / parkside),"$1250 - 1 bdrm, 1 bath",$1250,/ 1br -,4046731229,NaN,Sep 4 2013,/sfc/apa/4046731229.html,NaN,/ 1br -,http://sfbay.craigslist.org/sfc/apa/,0.0
6,(SOMA / south beach),Made For The Die-hard Giants Fan,$3249,/ 549ft² -,4046730047,-122.389798,Sep 4 2013,/sfc/apa/4046730047.html,37.774192,/ 549ft² -,http://sfbay.craigslist.org/sfc/apa/,549.0
7,(russian hill),Open Concept 1bed 1bath,$2690,/ 1br - 781ft² -,4046570245,-122.420787,Sep 4 2013,/sfc/apa/4046570245.html,37.796034,/ 1br - 781ft² -,http://sfbay.craigslist.org/sfc/apa/,781.0
8,NaN,"Contemporary, charming 2bds/1ba with private d...",$2850,/ 2br -,4006732632,-122.457100,Sep 4 2013,/sfc/apa/4006732632.html,37.735400,/ 2br -,http://sfbay.craigslist.org/sfc/apa/,0.0

In [133]:
# Let's look at the result.  We see that it doesn't change.  What went wrong?
# let's go back and fix it together
cl['bedrooms'][:9]

0        / 1br - 950ft² -
1        / 1br - 710ft² -
2        / 1br - 644ft² -
3       / 2br - 1450ft² -
4                 / 2br -
5                 / 1br -
6              / 549ft² -
7        / 1br - 781ft² -
8                 / 2br -
Name: bedrooms, dtype: object

In [134]:
# a second option is to use the apply() method.  
# apply() takes the name of a method as an argument, and applies that method to all rows in the dataframe
# the looping is implicit

cl = pd.read_csv('items.csv')
cl['sq ft'] = cl['bedrooms'].apply(clean_sf)
cl[:9]

,neighborhood,title,price,bedrooms,pid,longitude,date,link,latitude,sqft,sourcepage,sq ft
0,(SOMA / south beach),"1bed + Den, 1bath at Mission Bay",$2895,/ 1br - 950ft² -,4046628359,-122.399663,Sep 4 2013,/sfc/apa/4046628359.html,37.774623,/ 1br - 950ft² -,http://sfbay.craigslist.org/sfc/apa/,950
1,(SOMA / south beach),Love where you live!,$3354,/ 1br - 710ft² -,4046761563,NaN,Sep 4 2013,/sfc/apa/4046761563.html,NaN,/ 1br - 710ft² -,http://sfbay.craigslist.org/sfc/apa/,710
2,(inner sunset / UCSF),We Welcome Your Furry Friends! Call Today!,$2865,/ 1br - 644ft² -,4046661504,-122.470727,Sep 4 2013,/sfc/apa/4046661504.html,37.765739,/ 1br - 644ft² -,http://sfbay.craigslist.org/sfc/apa/,644
3,(financial district),Golden Gateway Commons | 2BR + office townhous...,$5500,/ 2br - 1450ft² -,4036170429,NaN,Sep 4 2013,/sfc/apa/4036170429.html,NaN,/ 2br - 1450ft² -,http://sfbay.craigslist.org/sfc/apa/,1450
4,(lower nob hill),Experience Luxury Living in San Fransisco!,$3892,/ 2br -,4046732678,NaN,Sep 4 2013,/sfc/apa/4046732678.html,NaN,/ 2br -,http://sfbay.craigslist.org/sfc/apa/,0
5,(sunset / parkside),"$1250 - 1 bdrm, 1 bath",$1250,/ 1br -,4046731229,NaN,Sep 4 2013,/sfc/apa/4046731229.html,NaN,/ 1br -,http://sfbay.craigslist.org/sfc/apa/,0
6,(SOMA / south beach),Made For The Die-hard Giants Fan,$3249,/ 549ft² -,4046730047,-122.389798,Sep 4 2013,/sfc/apa/4046730047.html,37.774192,/ 549ft² -,http://sfbay.craigslist.org/sfc/apa/,549
7,(russian hill),Open Concept 1bed 1bath,$2690,/ 1br - 781ft² -,4046570245,-122.420787,Sep 4 2013,/sfc/apa/4046570245.html,37.796034,/ 1br - 781ft² -,http://sfbay.craigslist.org/sfc/apa/,781
8,NaN,"Contemporary, charming 2bds/1ba with private d...",$2850,/ 2br -,4006732632,-122.457100,Sep 4 2013,/sfc/apa/4006732632.html,37.735400,/ 2br -,http://sfbay.craigslist.org/sfc/apa/,0

In [135]:
# if we have a very simple function, we can define it all in one line using the keyword lambda

cl['bedrooms_plus2'] = cl['sq ft'].apply(lambda x : x+2)
cl['bedrooms_plus2'][:9]

0     952
1     712
2     646
3    1452
4       2
5       2
6     551
7     783
8       2
Name: bedrooms_plus2, dtype: int64

In [136]:
# the above line is equivalent to:
def plus_two(x):
    return x+2

cl['bedrooms_plus2'] = cl['sq ft'].apply(plus_two)
cl['bedrooms_plus2'][:9]

0     952
1     712
2     646
3    1452
4       2
5       2
6     551
7     783
8       2
Name: bedrooms_plus2, dtype: int64

## Working with Pandas -- an in-class working session

OK, let's create a DataFrame from a dictionary, following the example on pg 116 of Python for Data Analysis (PDA).

In [47]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
df = DataFrame(data)

Explain the contents and structure of 'data'

What does 'DataFrame(data)' do? What if we did not begin that line with 'df ='?

Look at the contents of df, using just df by itself, and 'print df'.

In [48]:
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

We can refer to a column in two ways:

In [49]:
df['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
Name: state, dtype: object

In [50]:
df.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
Name: state, dtype: object

We can step through the rows in a dataframe

In [51]:
for i in df.state.index:
    print(df.state[i])

Ohio
Ohio
Ohio
Nevada
Nevada

And find the index value within each entry of a specific substring

In [52]:
for i in df.state.index:
    print(df.state[i].find('io'))

2
2
2
-1
-1

In [53]:
for i in df.state.index:
    if df.state[i]=='Ohio':
        print(df.state[i])
    else:
        print('Missing')

Ohio
Ohio
Ohio
Missing
Missing

## Now Your Turn

Below are a series of questions, with the answers remaining for you to fill in by using pandas expressions that draw on the methods in Chapter 5.  You should not need to use anything more than the content of this chapter -- a subset of the methods summarized above, to do this exercise.  Hopefully you can complete it within class if you've been keeping up with the reading.

How can we get a quick statistical profile of all the numeric columns?

In [54]:
df.describe()

             year       pop
count     5.00000  5.000000
mean   2001.20000  2.420000
std       0.83666  0.864292
min    2000.00000  1.500000
25%    2001.00000  1.700000
50%    2001.00000  2.400000
75%    2002.00000  2.900000
max    2002.00000  3.600000

Can you get a profile of a column that is not numeric, like state? Try it.

In [55]:
df.state.describe()

count        5
unique       2
top       Ohio
freq         3
Name: state, dtype: object

How can we print the data types of each column?

In [73]:
df.dtypes

state     object
year     float64
pop      float64
dtype: object

How can we print just the column containing state names?

In [57]:
print(df.state)

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
Name: state, dtype: object

How can we get a list of the states in the DataFrame, without duplicates?

In [58]:
df.state.unique()

array(['Ohio', 'Nevada'], dtype=object)

How can we get a count of how many rows we have in each state?

In [59]:
df.state.value_counts()

Ohio      3
Nevada    2
Name: state, dtype: int64

How can we compute the mean of population across all the rows?

In [60]:
df["pop"].mean()

2.4200000000000004

How can we compute the maximum population across all the rows?

In [61]:
df["pop"].max()

3.6

How can we compute the 20th percentile value of population?

In [62]:
df["pop"].quantile(.2)

1.6600000000000001

How can we compute a Boolean array indicating whether the state is 'Ohio'?

In [63]:
ohio = df.state == 'Ohio'
ohio

0     True
1     True
2     True
3    False
4    False
Name: state, dtype: bool

How can we select and print just the rows for Ohio?

In [64]:
df[df['state'].str.contains('Ohio')]

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

How can we create a new DataFrame containing only the Ohio records?

In [65]:
oh = df[df['state'].str.contains('Ohio')]
oh

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

How can we select and print just the rows in which population is more than 2?

In [66]:
df[df['pop'] > 2]

    state  year  pop
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

How could we compute the mean of population that is in Ohio, averaging across years?

In [67]:
oh = df[df['state'].str.contains('Ohio')]
oh['pop'].mean()

2.266666666666667

How can we print the DataFrame, sorted by State and within State, by Population?

In [68]:
df.sort_values(by=['state', 'pop'])

    state  year  pop
3  Nevada  2001  2.4
4  Nevada  2002  2.9
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6

How can we print the row for Ohio, 2002, selecting on its values (not on row and column indexes)?

In [69]:
df[df['state'].str.contains('Ohio')][df['year']==2002]

<ipython-input-69-abefc591ee02>:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df[df['state'].str.contains('Ohio')][df['year']==2002]

  state  year  pop
2  Ohio  2002  3.6

How can we use row and column indexing to set the population of Ohio in 2002 to 3.4?

In [70]:
df.loc[2,'pop'] = 3.4
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.4
3  Nevada  2001  2.4
4  Nevada  2002  2.9

How can we use row and column indexing to append a new record for Utah, initially with no population or year?

In [71]:
df.loc[5,'state'] = 'Utah'
df

    state    year  pop
0    Ohio  2000.0  1.5
1    Ohio  2001.0  1.7
2    Ohio  2002.0  3.4
3  Nevada  2001.0  2.4
4  Nevada  2002.0  2.9
5    Utah     NaN  NaN

How can we set the population to 2.5 and year to 2001 for the new record?

In [72]:
df.loc[5,'pop'] = 2.5
df.loc[5,'year'] = 2001
df

    state    year  pop
0    Ohio  2000.0  1.5
1    Ohio  2001.0  1.7
2    Ohio  2002.0  3.4
3  Nevada  2001.0  2.4
4  Nevada  2002.0  2.9
5    Utah  2001.0  2.5